#include <stdio.h>

#define i_ehn 11
#define i_tier 4
#define i_type 6

struct enhance_sta {
    int star;
    double mgnf;    
};

struct equipment {
    int eqp_type;
    char* name;
    int eqp_tier;
    int eqp_cost;
};
struct weapon{
    struct eqp_type;
    int eqp_atk;
};
struct armor{
    struct eqp_type;
    int eqp_def;
};

struct equipment w_list[4] = {
        
    };

struct enhance_sta e_s[11] = {
        {0, 1.0},
        {1, 1.1},
        {2, 1.2},
        {3, 1.3},
        {4, 1.4},
        {5, 1.5},
        {6, 1.6},
        {7, 1.7},
        {8, 1.8},
        {9, 1.9},
        {10, 2.0}
    };

int main(void) {
    double all_atk;
    int tier, enhancement,item_type;

    printf("티어를 입력하시오.: ");
    scanf("%d", &tier);
    printf("강화를 입력하시오.: ");
    scanf("%d", &enhancement);
    printf("아이템 타입을 입력하시오 (1:무기, 2:갑옷, 3:신발, 4:장갑, 5:망토, 6:마스크): ");
    scanf("%d", &item_type);

    all_atk = (w_list[tier - 1].w_atk * e_s[enhancement].mgnf);

    // 입력된 티어를 확인하고 무기 리스트에서 해당 무기를 찾음
    if (tier >= 1 && tier <= 4) { // 티어 범위가 1부터 3까지라고 가정
        printf("이름 : %s%d\n", w_list[tier - 1].name,enhancement);
        printf("공격력 : %.1lf\n", all_atk);
    } else {
        printf("잘못된 티어 입력입니다.\n");
    }

    return 0;
    
}


//     11      4        6
int bag[i_ehn][i_tier][i_type] ={
{ // 0강  무기 갑옷 신발 장갑 망토 마스크
    {1,1,1,1,1,1},     //1티어
    {0,0,0,0,0,0},     //2티어
    {0,0,0,0,0,0},     //3티어
    {0,0,0,0,0,0}      //4티어
},

{ // 1강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 2강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 3강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 4강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 5강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 6강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 7강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 8강 
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 9강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
},
{ // 10강
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0},
    {0,0,0,0,0,0}
}
};

